Revit 2027 API
MacroManager.Contains Method
 Indicates the given module is a member of this collection.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	MacroModule module
)
Public Function Contains (
	module As MacroModule
) As Boolean
public:
bool Contains(
	MacroModule^ module
)
member Contains :
        module : MacroModule -> bool
Parameters
module MacroModule
 The module.
Return Value
Boolean
 Returns true if the given module is a member of this collection, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace